# Hello! This project is all about getting the newest reports about confirmed COVID-19 cases around the world.

## Connecting to my local MySQL server

In [1]:
import pandas as pd
import sqlalchemy as sa

In [2]:
# Creating engine required later by Pandas' methods
engine = sa.create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}".format(user="root", pw="password123", db="ProjectDb"))

In [3]:
# Urls to daily refreshed datasets provided by ourworldindata.org
metricsUrl = "https://covid.ourworldindata.org/data/ecdc/full_data.csv"
populationUrl = "https://covid.ourworldindata.org/data/ecdc/locations.csv"

In [4]:
# Creating dataframe objects
df1 = pd.read_csv(metricsUrl)
df2 = pd.read_csv(populationUrl)

In [5]:
df1

,date,location,new_cases,new_deaths,total_cases,total_deaths
0,2019-12-31,Afghanistan,0,0,0,0
1,2020-01-01,Afghanistan,0,0,0,0
2,2020-01-02,Afghanistan,0,0,0,0
3,2020-01-03,Afghanistan,0,0,0,0
4,2020-01-04,Afghanistan,0,0,0,0
...,...,...,...,...,...,...
19810,2020-05-23,Zimbabwe,5,0,56,4
19811,2020-05-24,Zimbabwe,0,0,56,4
19812,2020-05-25,Zimbabwe,0,0,56,4
19813,2020-05-26,Zimbabwe,0,0,56,4
19814,2020-05-27,Zimbabwe,0,0,56,4

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19815 entries, 0 to 19814
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          19815 non-null  object
 1   location      19815 non-null  object
 2   new_cases     19815 non-null  int64
 3   new_deaths    19815 non-null  int64
 4   total_cases   19815 non-null  int64
 5   total_deaths  19815 non-null  int64
dtypes: int64(4), object(2)
memory usage: 929.0+ KB

In [7]:
df2

,countriesAndTerritories,location,continent,population_year,population
0,Afghanistan,Afghanistan,Asia,2020.0,38928341.0
1,Albania,Albania,Europe,2020.0,2877800.0
2,Algeria,Algeria,Africa,2020.0,43851043.0
3,Andorra,Andorra,Europe,2020.0,77265.0
4,Angola,Angola,Africa,2020.0,32866268.0
...,...,...,...,...,...
205,Vietnam,Vietnam,Asia,2020.0,97338583.0
206,Western_Sahara,Western Sahara,Africa,2020.0,597330.0
207,Yemen,Yemen,Asia,2020.0,29825968.0
208,Zambia,Zambia,Africa,2020.0,18383956.0
209,Zimbabwe,Zimbabwe,Africa,2020.0,14862927.0

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 210 entries, 0 to 209
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   countriesAndTerritories  210 non-null    object
 1   location                 210 non-null    object
 2   continent                209 non-null    object
 3   population_year          209 non-null    float64
 4   population               209 non-null    float64
dtypes: float64(2), object(3)
memory usage: 8.3+ KB

In [ ]:
# Creating new tables
df1.to_sql("metrics", con = engine)
df2.to_sql("population", con = engine)

In [10]:
df1.dtypes

date            object
location        object
new_cases        int64
new_deaths       int64
total_cases      int64
total_deaths     int64
dtype: object

In [11]:
df2.dtypes

countriesAndTerritories     object
location                    object
continent                   object
population_year            float64
population                 float64
dtype: object

In [12]:
engine.execute("SHOW TABLES")

In [13]:
# Confirming both tables are just fine
engine.table_names()

['metrics', 'population']

# Reports

## 1. Continents and countries where the most people have died from COVID-19

In [131]:
df = pd.read_sql("SELECT p.continent as Continent, sum(m.new_deaths) AS 'Total Deaths' FROM metrics m, population p WHERE m.location = p.location GROUP BY p.continent ORDER BY 2 DESC", con = engine)
df

       Continent  Total Deaths
0         Europe      168158.0
1  North America      113792.0
2  South America       32599.0
3           Asia       27830.0
4         Africa        3478.0
5        Oceania         130.0
6           None           7.0

In [15]:
# None - 7 pepople who have died from coronavirus on cruise ship in Japan

In [132]:
df = pd.read_sql("SELECT m.location AS Country, sum(m.new_deaths) AS 'Total Deaths' FROM metrics m, population p WHERE m.location = p.location GROUP BY m.location ORDER BY 2 DESC LIMIT 10", con = engine)
df

          Country  Total Deaths
0   United States       98220.0
1  United Kingdom       36914.0
2           Italy       32877.0
3          France       28432.0
4           Spain       26834.0
5          Brazil       23473.0
6         Belgium        9312.0
7         Germany        8302.0
8          Mexico        7633.0
9            Iran        7451.0

## 2. Countries with the highest Infection/Death rate

In [78]:
df = pd.read_sql("SELECT m.location AS Country, sum(new_cases) / p.citizens * 100 AS 'Percentage of confirmed cases (since the first one) in population' FROM metrics m, population p WHERE m.location=p.location GROUP BY m.location, p.citizens ORDER BY 2 DESC LIMIT 10",con =engine)
df

,Country,Percentage of confirmed cases (since the first one) in population
0,San Marino,1.9624
1,Qatar,1.5781
2,Vatican,1.4833
3,Andorra,0.9875
4,Luxembourg,0.6379
5,Singapore,0.5463
6,Bahrain,0.5390
7,Iceland,0.5286
8,Kuwait,0.5144
9,Spain,0.5035

In [153]:
df = pd.read_sql("SELECT m.location AS Country, sum(new_deaths) / p.citizens * 100 AS 'Percentage of deaths caused by COVID-19 in population' FROM metrics m, population p WHERE m.location=p.location GROUP BY m.location, p.citizens ORDER BY 2 DESC LIMIT 10",con =engine)
df

,Country,Percentage of deaths caused by COVID-19 in population
0,San Marino,0.1238
1,Belgium,0.0803
2,Andorra,0.0660
3,Spain,0.0574
4,Italy,0.0544
5,United Kingdom,0.0544
6,France,0.0436
7,Sweden,0.0399
8,Sint Maarten (Dutch part),0.0350
9,Netherlands,0.0340

## 3. The worst days since the very start of the pandemic (in the World, Europe and Poland)

In [97]:
df = pd.read_sql("SELECT m.date AS 'Date', max(m.new_deaths) AS 'Deaths in the world' FROM metrics m WHERE m.location='World' GROUP BY m.date, m.location ORDER BY 2 DESC LIMIT 1",con =engine)
df

         Date  Deaths in the world
0  2020-04-16                10520

In [130]:
df = pd.read_sql("SELECT m.date AS 'Date', max(m.new_deaths) AS 'Deaths in Europe' FROM metrics m, population p WHERE m.location=p.location AND p.continent='Europe' GROUP BY m.date, p.continent ORDER BY 2 DESC LIMIT 1",con =engine)
df

         Date  Deaths in Europe
0  2020-04-04              2004

In [125]:
df = pd.read_sql("SELECT m.date AS 'Date', max(m.new_deaths) AS 'Deaths in Poland' FROM metrics m WHERE m.location='Poland' GROUP BY m.date, m.location ORDER BY 2 DESC LIMIT 1",con =engine)
df

         Date  Deaths in Poland
0  2020-04-25                40

## 4. Statistics for Poland

In [135]:
df = pd.read_sql("SELECT m.location AS 'Country', sum(m.new_cases) AS 'Total infections' FROM metrics m, population p WHERE m.location=p.location AND m.location='Poland' GROUP BY m.location",con =engine)
df

  Country  Total infections
0  Poland           21631.0

In [136]:
df = pd.read_sql("SELECT m.location AS 'Country', sum(m.new_deaths) AS 'Total deaths' FROM metrics m, population p WHERE m.location=p.location AND m.location='Poland' GROUP BY m.location",con =engine)
df

  Country  Total deaths
0  Poland        1007.0

In [149]:
df = pd.read_sql("SELECT m.location AS Country, sum(new_cases) / p.citizens * 100 AS 'Rate of infections (in percents)' FROM metrics m, population p WHERE m.location=p.location AND m.location='Poland' GROUP BY m.location, p.citizens",con =engine)
df

  Country  Rate of infections (in percents)
0  Poland                            0.0572

In [155]:
df = pd.read_sql("SELECT m.location AS Country, sum(new_deaths) / p.citizens * 100 AS 'Rate of deaths (in percents)' FROM metrics m, population p WHERE m.location=p.location AND m.location='Poland' GROUP BY m.location, p.citizens",con =engine)
df

  Country  Rate of deaths (in percents)
0  Poland                        0.0027

## 5.